Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: བདག་གིས་མཐོང་བ་དང་ཐོས་པ་བཞིན་དུ་བདེན་པ་མ་ཡིན་པར་ཡང་འཛིན་ལ། ཕྱིས་ཞིབ་ཏུ་བརྟགས་ན་ཡང་བརྫུན་པ་སླུ་བའི་ཆོས་སུ་ཤེས་སོ། །
en: They believe that what they see and hear are not real, and afterward, when they examine them in detail, they know that they were false and deceptive phenomena.

source: དེ་ལྟ་བས་ན་ཐབས་མཁས་པ་རྣམས་ཀྱིས་ནི། ཆོས་འདི་དག་ཐམས་ཅད་ནི་ཡང་དག་པ་མ་ཡིན་པའི་རང་བཞིན་དུ་རྟོགས་ཏེ།
en: “Therefore, the wise realize the nature of unreality of all these phenomena.

source: ཇི་ལྟར་མཐོང་བ་དང་ཐོས་པ་ཡང་ཀུན་རྫོབ་ཙམ་དུ་དེ་དག་གི་དོན་མཚོན་པ་དང་ཚིག་གི་ཐ་སྙད་ལ་བརྟེན་ནས། ཡང་དག་པའི་དོན་ཤེས་པར་བྱ་བ་ཙམ་དུ་ཟད་ཀྱི་དོན་དམ་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ་སྙམ་མོ། །
en: They think, ‘Whatever is seen and heard is merely a correct meaning known on the basis of representations and the terminology of words merely on a relative level, but ultimately it is not like that.’

source: ཡང་ཚངས་པ་ཆེན་པོ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འཕགས་པ་འཇིག་རྟེན་ལས་འདས་པའི་ཤེས་རབ་ཀྱི་མིག་མ་ཐོབ་པ་རྣམས་ཀྱིས་ནི། ཆོས་འདི་དག་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་བརྗོད་དུ་མེད་པར་ཡང་མི་ཤེས་ལ།
en: “Mahābrahmā, childlike, ordinary beings who have not attained the world-transcending wisdom eyes of the āryas do not know the inexpressible nature of phenomena.

source: གང་མཐོང་བ་དང་། ཐོས་པ་དང་། འདུ་བྱེད་དང་། འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་རྣམས་ཇི་ལྟར་བརྟགས་པ་ལྟར་བདེན་པ་ཉིད་དུ་མངོན་པར་ཞེན་ཏེ། ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་བརྗོད་དུ་མེད་པ་དོན་དམ་པའི་ཚུལ་དེ་ཤེས་པར་མི་ནུས་སོ། །
en: Therefore, however they examine what they see or hear, whether composite or noncomposite phenomena, they become attached to it as real, and they are unable to know the ultimate, inexpressible true nature of phenomena.

source: དེ་ལ་འཕགས་པ་རྣམས་ཀྱིས་ནི་གང་གཟིགས་ཤིང་གསན་པ་དང་། འདུ་བྱེད་དང་། འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་རྣམས་ཀྱིས་མཐུ་དང་། ལས་ཇི་ལྟ་བུ་ཡིན་པ་དེ་ལ་བདེན་པའོ་ཞེས་མངོན་པར་མི་ཞེན་ཏེ།
en: “Whatever the āryas see or hear, and whatever the power and activity of the composite and noncomposite phenomena may be, they do not become attached to them as real.

source: འདུ་བྱེད་ཀྱི་ཆོས་ཀྱང་མི་བདེན་པ། འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་ཀྱང་མི་བདེན་པ།
en: The composite phenomena are not real and the noncomposite phenomena are not real.

source: ཡང་དག་པ་མ་ཡིན་པའི་རྟོག་པས་བརྟགས་པ་ཙམ་དུ་འདུ་བྱེད་དང་། འདུ་བྱེད་མ་ཡིན་པའི་མཚན་ཉིད་ཀྱང་མིང་ཙམ་དུ་ཟད་པ།
en: They are simply characteristics and names of the composite and noncomposite as a result of an examination of them by invalid thought.

source: བདེན་པའི་རང་བཞིན་དུ་མི་གྲུབ་པ་སྟེ། འཕགས་པ་རྣམས་ཀྱིས་ཀུན་རྫོབ་ཀྱི་ཐ་སྙད་ལ་བརྟེན་ནས། ཡང་དག་པའི་བདེན་པའི་དོན་དེ་སྟོན་པར་བྱེད་དོ། །
en: They have no real nature, but the āryas teach that true meaning by relying on relative terminology.

source: དེ་བཞིན་དུ་ཚངས་པ་ཆེན་པོ་གང་འཕགས་པ་རྣམས་ནི། འཕགས་པའི་ཡེ་ཤེས་དང་། འཕགས་པའི་གཟིགས་པས་ཆོས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་བརྗོད་དུ་མེད་པ་བཞིན། འདུ་བྱེད་དང་། འདུ་བྱེད་མ་ཡིན་པའི་ཆོས་ཀྱང་དེ་བཞིན་དུ་ལྟ་སྟེ།
en: “In the same way, Mahābrahmā, the āryas see, with their superior knowledge and superior vision, the inexpressible true nature of phenomena, and they see the composite and noncomposite phenomena in the same way.

source: ཀུན་རྫོབ་ཏུ་མིང་དང་མཚན་མ་སྣ་ཚོགས་ལ་བརྟེན་ནས། གཞན་ལ་སྟོན་པར་བྱེད་དོ། །
en: Yet, on the relative level, they teach others by relying on various names and terms.”

source: དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་འཕྲོ་ལ་ཚངས་པ་ཆེན་པོས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སེམས་ཅན་ཇི་སྙེད་ཅིག་གིས་ཆོས་ཟབ་མོ་འདི་ལྟ་བུ་རྟོགས་ཤིང་ཤེས་པར་ནུས། སྨྲས་པ།
en: Then Mahābrahmā asked the bodhisattva Ratnārcī, “How many beings are able to realize and know this kind of profound Dharma?”

source: ཚངས་པ་ཆེན་པོ་གང་སྤྲུལ་པ་མང་པོའི་སེམས་དང་སེམས་ལས་བྱུང་བས་ཆོས་ཟབ་མོ་འདི་ཡང་དག་པར་ཤེས་པར་གྱུར་པ་དེ་སྙེད་ཀྱིས་ཤེས་སོ། །
en: “Mahābrahmā,” replied Ratnārcī, “this profound Dharma is known by the minds and mental events of numerous illusory beings. That is how many.”

source: ཚངས་པའི་རྒྱལ་པོས་སྨྲས་པ། སྤྲུལ་པ་དེ་དག་ཉིད་ཀྱང་རང་བཞིན་ཡོད་པ་མ་ཡིན་ན། དེ་དག་གིས་སེམས་དང་། སེམས་ལས་བྱུང་བ་གང་ནས་སྐྱེ་བར་འགྱུར།
en: “Those illusory beings are nonexistent by nature,” said Brahmarāja, “so from where do their minds and mental events arise?”

source: སྨྲས་པ། གང་ཆོས་ཀྱི་དབྱིངས་ཡོད་པ་ཡང་མ་ཡིན། མེད་པ་ཡང་མ་ཡིན་པར་ཡང་དག་པར་ཤེས་པ་དེ་དག་གིས། ཟབ་མོ་དེའི་དོན་ཤེས་པར་ནུས་སོ། །
en: “Those who truly know that the Dharma realm is neither existent nor nonexistent are able to know the meaning of that profundity,” replied Ratnārcī.

source: དེ་ནས་ཚངས་པ་ཆེན་པོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་འཕྲོ་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ།
en: Mahābrahmā then said to the Bhagavat, “Bhagavat, this bodhisattva Ratnārcī is inconceivable.

source: ཆོས་ཀྱི་གཞུང་ཟབ་མོ་འདི་ལ་མཁས་པ་ལགས་སོ། །
en: She is wise in this profound Dharma teaching.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ཏེ། ཚངས་པ་ཆེན་པོ་དེ་ཇི་ལྟར་ཁྱོད་ཀྱིས་སྨྲས་པ་དེ་བཞིན་ནོ། །
en: “It is like that, Mahābrahmā, it is just as you have said,” replied the Bhagavat.

source: བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་འཕྲོ་འདིས་ཁྱེད་ལ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་ནན་ཏན་དུ་སྒྲུབས་ཤིག་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: “Diligently practice what this bodhisattva Ratnārcī has taught, and you will attain the patience toward the quality of birthlessness.”

source: དེ་ནས་ལྷའི་རྒྱལ་པོ་ཚངས་པ་ཆེན་པོ་དང་། གཞན་ཡང་ཚངས་པའི་འཁོར་དེ་དག་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་བས་བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་འཕྲོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Then Mahābrahmā, the king of devas, and also his entourage of Brahmās, rose from their seats and with their robes over one shoulder, and with palms together, they bowed down their heads to the bodhisattva Ratnārcī’s feet.

source: ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེང་སྐྱེས་བུ་ཆེན་པོ་ཁྱོད་དང་ཕྲད་ཅིང་བདག་ཅག་གིས་དམ་པའི་ཆོས་འདི་ལྟ་བུ་ཐོས་པར་གྱུར་པ་ངོ་མཚར་ཆེ་བ་ལགས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་འཕྲོ་འདི་མ་འོངས་པའི་དུས་ན། རིན་པོ་ཆེའི་འོད་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: They said, “On this day we have met such a great being as you and have heard this sublime Dharma.

source: བདེ་བར་གཤེགས་པ།
en: It is a wonder!”

source: འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavat then said to Brahmarāja, “In the future, this Cittaratnārcī will become a tathāgata, an arhat, a samyaksaṃbuddha, one with wisdom and virtuous conduct, a sugata, a knower of the world, an unsurpassable being, a guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, by the name of Essence of Illustrious Precious Radiance.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཕྲག་སུམ་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: When he said this, thirty million bodhisattvas attained irreversibility from the highest, most complete enlightenment.

source: ལྷའི་བུ་ཁྲི་ཕྲག་བརྒྱད་སྟོང་དང་། རྒྱལ་པོ་དང་། བློན་པོ་ལ་སོགས་པ། ཚད་མེད་གྲངས་མེད་པ་རྣམས་ཀྱིས་རྡུལ་མེད་ཅིང་རྡུལ་དང་བྲལ་བའི་ཆོས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པར་གྱུར་ཏོ། །
en: Eighty million devas and countless, innumerable kings, ministers, and so on became free of dust and attained pure Dharma eyes for the dust-free Dharma.

source: དེ་ནས་འཁོར་འདུས་པ་དེའི་ནང་ན། དགེ་སློང་ཁྲི་ཕྲག་ལྔ་བཅུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ཕྱིར་མི་ལྡོག་པར་སེམས་པ་དེ་དག་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་འོད་འཕྲོས་ཆོས་བསྟན་པ་འདི་ཐོས་ནས། བྱང་ཆུབ་ཀྱི་སེམས་ཕྱིར་ཞིང་བརྟན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་བླ་ན་མེད་པའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་ནས་ཡང་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: At that time, in that vast assembly, five hundred thousand bhikṣus, whose minds were irreversible from the practice of bodhisattva conduct and from the enlightenment mind, and who had heard the Dharma teaching of the bodhisattva Ratnārcī, developed continuous stability in their aspiration for enlightenment, and perfected supreme, inconceivable prayers.

source: སོ་སོ་ནས་རང་རང་གི་གོས་གྱོན་པ་ཕུད་དེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་གསོལ་ནས། བླ་ན་མེད་པ་མཆོག་དམ་པའི་སེམས་བསྐྱེད་དེ་སྨོན་ལམ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་གིས་དགེ་བའི་རྩ་བ་ཅི་མཆིས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ་ཞེས་སྨོན་ལམ་བཏབ་བོ། །
en: In developing the aspiration for enlightenment, each one took off his robes and offered them to the bodhisattva and they made this highest, supreme aspiration: “We dedicate all the roots of merit we have accumulated to the highest, most complete enlightenment.”

source: ཚངས་པ་ཆེན་པོ་དགེ་སློང་དེ་དག་གིས། བསོད་ནམས་དེ་ལ་བརྟེན་ནས། ཇི་སྐད་སྨྲས་པ་བཞིན་ནན་ཏན་དུ་བསྒྲུབས་ནས། བསྐལ་པ་ཆེན་པོ་དགུ་བཅུ་འདས་པ་ན། འཁོར་བ་ལས་ཡོངས་སུ་འདས་པའི་ཤེས་པ་སྐྱེས་པར་གྱུར་ཏོ། །
en: The Bhagavat said, “Mahābrahmā, those bhikṣus, on the basis of that merit, will practice diligently as they have said, and after ninety great eons have passed, there will arise the knowledge that transcends saṃsāra.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དེ་དག་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་བསྐལ་པ་གྲངས་མེད་པ་སུམ་ཅུ་འདས་པའི་འོག་ཏུ། བླ་ན་མེད་པའི་སངས་རྒྱས་སུ་འགྱུར་ཏེ། བསྐལ་པའི་མིང་ནི་རྒྱལ་བར་དགའ་བའི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ།
en: Then the Bhagavat prophesied to that multitude of bhikṣus, “Bhikṣus, after thirty asaṃkhyeya eons have passed you will become unsurpassable buddhas during an eon by the name of Difficult to Conquer King of Radiance in a realm by the name of Vimalaprabhā.

source: ཡུལ་གྱི་མིང་ནི་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བར་དུས་གཅིག་ཏུ་ཀུན་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། དེ་དག་ཀུན་ཀྱང་མཚན་སྨོན་ལམ་རྣམ་པར་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཡོན་ཏན་གྱི་མཚན་བཅུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཞེས་ལུང་བསྟན་ཏོ། །
en: You will all attain the highest, most complete enlightenment of buddhahood simultaneously and you will all have the same name—King Array of Pure Prayers—and you will have the complete ten features of qualities.

source: གཞན་ཡང་ཚངས་པ་ཆེན་པོ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་གང་ཉན་པ་དང་འཛིན་པ་དེ་དག་ནི་མཐུ་དང་། གཟི་བརྗིད་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་ཏེ། དཔེར་ན་གང་ལ་ལ་ཞིག་གིས། ཐབས་དང་མི་ལྡན་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག །
en: “Moreover, Mahābrahmā, whoever listens to and possesses this Lord King of Sūtras, the Sublime Golden Light will possess great power and majesty.

source: བསྐལ་པ་ཆེན་པོ་བརྒྱད་སྟོང་དུ་སྤྱོད་པ་བས། གང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་གླེགས་བམ་དུ་བྲིས་ཏེ། ཟླ་བ་ཕྱེད་ཕྱེད་ཅིང་སེམས་རྩེ་གཅིག་ཏུ་བྱས་ཏེ་ཀློག་ཅིང་འདོན་ན།
en: “If someone without method were to practice the six perfections for eighty great eons, and a noble man or noble woman were to write a volume of this Lord King of Sūtras, the Sublime Golden Light, and every half-month one-pointedly read and recited it, the previous accumulation of merit would not be even a hundredth of this accumulation of merit.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་འདི་ལ། བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་ཕོད་པ་ནས། གྲངས་སུ་བགྲང་བ་དང་དཔེར་བསྒྲུན་པར་ཡང་མི་བཟོད་དོ། །
en: It could not even be used to enumerate it or be an analogy for it.

source: ཚངས་པ་ཆེན་པོ་དེ་ལྟ་བས་ན། ཁྱོད་ཀྱིས་རྟག་ཏུ་ཡིད་ལ་བྱ་ཞིང་། ནན་ཏན་དུ་བསྒྲུབ་པ་དང་། གཟུང་ཞིང་གཞན་ལ་ཡང་ཡང་དག་པར་རྒྱ་ཆེར་བསྟན་པར་བྱའོ། །
en: “Therefore, Mahābrahmā, always keep it in mind, practice it diligently, retain it, and teach it widely to others.

source: སྔོན་འདས་པའི་དུས་ན་ང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། ཇི་ལྟར་སྐྱེས་བུ་དཔའ་བོ་གཡུལ་ངོར་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་བཞིན་དུ། ངས་ཀྱང་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་གཟུང་ཞིང་འཛིན་པ་དང་། ཀློག་ཅིང་འདོན་པ་དང་། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པ་ལ་ཐོགས་པ་མེད་པར་གྱུར་ཏོ། །
en: In the past when I was practicing the path of a bodhisattva, just as a warrior in battle has no concern for his life or body, in the same way I obtained, possessed, read, recited, and taught widely to others this king that is the lord of sūtras.

source: ཚངས་པ་ཆེན་པོ་དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ནམ་འཇིག་རྟེན་ན་གནས་ཀྱི་བར་དུ་རིན་པོ་ཆེ་སྣ་བདུན་ཡང་མེད་པར་མི་འགྱུར་རོ། །གལ་ཏེ་རྒྱལ་པོ་མི་བཞུགས་ན། རིན་པོ་ཆེ་སྣ་བདུན་ཡང་མོད་ལ་མེད་པར་འགྱུར་རོ། །
en: “Mahābrahmā, while a cakravartin is in the world, his seven jewels do not cease to exist, but if the king is no longer present, then the seven jewels will also vanish at that same time.

source: ཚངས་པ་ཆེན་པོ་དེ་ལྟར་དེ་བཞིན་དུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཇིག་རྟེན་ན་གནས་ཀྱི་བར་དུ། བླ་ན་མེད་པའི་ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱང་ནུབ་པར་མི་འགྱུར་རོ། །
en: “Mahābrahmā, in that same way, while this Lord King of Sūtras, the Sublime Golden Light is in the world, all of the unsurpassable, precious Dharma will not cease to be.

source: མདོ་སྡེའི་རྒྱལ་པོ་འདི་ནམ་མེད་པ་ན་གཞན་དག་ཀྱང་ནུབ་པར་འགྱུར་རོ། །དེ་ལྟ་བས་ན་མདོ་སྡེའི་རྒྱལ་པོ་འདི་སེམས་རྩེ་གཅིག་ཏུ་བྱས་ཏེ། མཉན་པ་དང་། གཟུང་བ་དང་།
en: When this king of sūtras ceases to be, then the rest will also vanish.

source: ཀློག་པ་དང་། གཞན་ལ་ཡང་རྒྱ་ཆེར་བཤད་པ་དང་། ཡི་གེར་འདྲིར་འཇུག་པ་དང་། ལུས་དང་སྲོག་ལ་མི་བལྟ་བས་ངལ་བ་དང་། དུབ་པ་ཁྱད་དུ་གསོད་ཅིང་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ་སྟེ།
en: Therefore, with a one-pointed mind, listen to, obtain, read, and teach widely to others this king of sūtras and have them write it out—without concern for life and body, ignoring tiredness and exhaustion, practice the perfection of diligence.

source: བསོད་ནམས་ཀྱི་ནང་ན་མཆོག་ཡིན་པར་ངའི་འཁོར་རྣམས་ཀྱིས་ཀྱང་དེ་བཞིན་དུ་བསླབ་ཅིང་ནན་ཏན་དུ་བྱའོ། །
en: This is supreme among all merit and therefore my followers similarly should diligently train and be dedicated in that way.”

source: དེ་ནས་ཚངས་པའི་རྒྱལ་པོ་ཆེན་པོ་ལ་སོགས་ཏེ། ཚངས་པའི་འཁོར་གྲངས་མེད་པ་དང་། བརྒྱ་བྱིན་ལྷའི་དབང་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གཞན་ཡང་གནོད་སྦྱིན་གྱི་དབང་པོ་ལ་སོགས་པ་དེ་དག་ཐམས་ཅད་སྟན་ལས་ལངས་ཏེ།
en: Then great Brahmarāja and the rest, the innumerable Brahmā entourage, the deva lord Śakra, the Four Mahārājas, and also the yakṣa lords, and so on, rose from their seats.

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་བསྲུང་བ་དང་ཡོངས་སུ་རྒྱས་པར་བགྱིའོ། །
en: With their robes over one shoulder, kneeling on their right knees, and with palms together, they bowed and said to the Bhagavat, “Bhagavat we will protect and spread this Lord King of Sūtras, the Sublime Golden Light.

source: ཆོས་འདི་སྟོན་པའི་ཚེ་བགེགས་དང་བར་ཆད་ཀུན་བསལ་ཏེ།
en: When it is being taught, we will dispel hindrances and obstacles.

source: དགེ་བར་འགྱུར་བ་དང་། ཁ་དོག་དང་། མཐུ་ཡོངས་སུ་རྫོགས་པ་དང་། སྤོབས་པ་ཐོགས་པ་མེད་པ་དང་། ལུས་དང་སེམས་བདེ་བར་འགྱུར་བ་དང་།
en: We will create goodness, perfect complexion and strength, unimpeded eloquence, happiness in body and mind, and also make the assemblies experience happiness.

source: དེའི་འཁོར་རྣམས་ཀྱང་བདེ་བ་ཉམས་སུ་མྱོང་བ་དང་། གང་ན་གནས་པའི་ཡུལ་འཁོར་དེ་ཡང་མུ་གེ་དང་དགྲའི་འཇིགས་པ་དང་། མི་མ་ཡིན་པས་འཚེ་བ་ཞིག་མཆིས་ན་ཡང་བདག་ཅག་ལྷའི་འཁོར་གྱིས་ཡོངས་སུ་བསྲུངས་པས། དེ་དག་བདེ་ཞིང་སྐྱིད་པ་དང་། གནོད་པ་རྣམས་མ་བྱུང་བར་གྱུར་ན།
en: In the land where such teachers dwell, if there is famine, fear of enemies, or harm from nonhumans, we, the entourage of devas, will protect them so that they will be blissful and happy, and no harm will occur.

source: དེ་དག་ཀྱང་བདག་ཅག་ལྷའི་མཐུ་ལགས་པར་འཚལ་བར་བགྱིའོ། །
en: That is the power that we devas have.

source: གང་ལ་ལ་ཞིག་མདོ་སྡེ་འདི་ལ་མཆོད་ཅིང་རིམ་གྲོ་བགྱིད་ན། དེ་ལ་བདག་ཅག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་འདྲ་བར་མཆོད་ཅིང་རིམ་གྲོ་བགྱིའོ། །
en: If anyone makes an offering to or honors this sūtra, we will make offerings to them and honor them as if they were the same as the buddha bhagavat.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་རྒྱལ་པོ་ཚངས་པ་ཆེན་པོ་ལ་སོགས་ཏེ།
en: Then the Bhagavat said, “Excellent!”

source: ཚངས་པའི་འཁོར་དེ་དག་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་ལ་སོགས་པ་རྣམས་ལ་ལེགས་སོ་ཞེས་བཀའ་སྩལ་ཏེ།
en: to great Mahābrahmā, the king of devas, and the rest—the Brahmā entourage, the Four Mahārājas, the yakṣa lords, and so on: “Excellent!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དམ་པའི་ཆོས་ཟབ་མོ་འདི་ཡང་ཐོས།
en: Noble ones, you have heard the profound, sublime Dharma.

source: མདོ་སྡེའི་དབང་པོ་འདི་དང་འདི་འཛིན་པ་ལ་བསྲུང་བ་དང་། བསྐྱབ་པའི་སེམས་བསྐྱེད་པ་དེས་བསོད་ནམས་ཀྱི་ཁྱད་པར་ཚད་མེད་པ་དང་ལྡན་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Through your aspiration to guard and protect this lord of sūtras and the various holders of the sūtra, you will attain measureless, special merit, so that you will quickly attain the highest, most complete enlightenment of perfect buddhahood.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚངས་པའི་རྒྱལ་པོ་ལ་སོགས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: When the Bhagavat had said that, Brahmarāja and the others praised the Bhagavat’s words.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་སྟོང་པ་ཉིད་ལ་བརྟེན་ནས་བསམ་པ་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བཅུ་པའོ།། །།དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་། རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གཟིགས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དགོངས་པ།
en: This concludes “Fulfilling Wishes on the Basis of Emptiness,” the tenth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བ། ལྷའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཕྱག་བགྱིས་པ། ལྷའི་ཚོགས་ཐམས་ཅད་ཀྱིས་མཆོད་པ། ལྷའི་དབང་པོའི་ཚོགས་ཐམས་ཅད་ཀྱིས་མངོན་པར་བསྟོད་པ། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་མཆོད་ཅིང་བསྔགས་ཏེ། བརྗོད་ནས་རབ་ཏུ་བཀུར་བ། ལྷའི་ཁང་ཁྱིམ་ཐམས་ཅད་སྣང་བར་བགྱིད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་བདེ་བ་ཐམས་ཅད་རབ་ཏུ་སྦྱིན་པར་བགྱིད་པ། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཐམས་ཅད་སྐེམས་པ། འཇིགས་པ་ཐམས་ཅད་ཀྱི་རྒྱུན་གཅོད་པ། ཕ་རོལ་གྱི་དམག་ཚོགས་ཐམས་ཅད་རབ་ཏུ་ཟློག་པ། མུ་གེའི་ཡ་ང་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། ནད་ཀྱི་ཡ་ང་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། གཟའི་གནོད་པ་ཐམས་ཅད་སེལ་བ། མཆོག་ཏུ་ཞི་བར་བགྱིད་པ། མྱ་ངན་དང་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། གནོད་པ་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་ཞི་བར་བགྱིད་པ། གནོད་པ་འབུམ་རབ་ཏུ་འཇོམས་པར་བགྱིད་ལགས་སོ། །
en: Chapter 11: The Four Mahārājas Look Upon Devas and Humans Then Mahārāja Vaiśravaṇa, Mahārāja Dhṛtarāṣṭra, Mahārāja Virūḍhaka, and Mahārāja Virūpākṣa rose from their seats, and with their upper robes over one shoulder, knelt on their right knees and, with palms together in homage, bowed toward the Bhagavat and said, “Venerable Bhagavat, this Lord King of Sūtras, the Sublime Golden Light is taught by all tathāgatas; it is viewed by all the tathāgatas; it is thought of by all the tathāgatas; it is possessed by all the assemblies of bodhisattvas; it is paid homage to by all the hosts of devas; it is offered to by all the hosts of devas; it is praised by all the hosts of the lords of devas; it is offered to, praised, and honored by all the protectors of the world; it illuminates all the divine mansions; it brings supreme happiness to all beings; it extinguishes all the suffering in the hells, in the lives of animals, and in the realm of Yama; it brings fears to an end; it repels all the armies of enemies; it brings the calamity of famines to an end; it brings the calamity of disease to an end; it dispels all planetary influences; it brings perfect peace; it ends misery and troubles; and it brings to an end various kinds of calamities—it overcomes a hundred thousand calamities.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཁོར་གྱི་ནང་དུ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་ན། ཆོས་མཉན་པ་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་བཞིའི་ལྷའི་ལུས་འདི་གཟི་བྱིན་ཆེན་པོས་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །བདག་ཅག་གི་ལུས་ལ་བརྩོན་པ་དང་། སྟོབས་དང་མཐུ་ཡང་བསྐྱེད་པར་འགྱུར། གཟི་བརྗིད་དང་།
en: “Venerable Bhagavat, if you extensively elucidate this Lord King of Sūtras, the Sublime Golden Light through hearing the Dharma, through the liquid of the amṛta of the Dharma, then the divine bodies of we Four Mahārājas and our armies and attendants will increase in their great magnificence; diligence, strength, and power will arise in our bodies; and magnificence, splendor, and good fortune will enter our bodies.

source: དཔལ་དང་། ཕུན་སུམ་ཚོགས་པ་ཡང་བདག་ཅག་གི་ལུས་ལ་འཇུག་པར་འགྱུར་ཏེ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་ནི་ཆོས་དང་ལྡན་པ། ཆོས་སྨྲ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ལགས་ཏེ།
en: “Venerable Bhagavat, we Four Mahārājas possess the Dharma, teach the Dharma, and are Dharma kings.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་ཆོས་ཀྱིས། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། དྲི་ཟ་དང་།
en: “Venerable Bhagavat, through the Dharma we are the kings of devas, nāgas, asuras, garuḍas, gandharvas, kinnaras, and mahoragas.

source: མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱི་རྒྱལ་པོ་བགྱིའོ། །འབྱུང་པོའི་ཚོགས་མི་བཟད་པ། སྙིང་རྗེ་མ་མཆིས་པ། གཞན་གྱི་གཟི་བྱིན་འཕྲོག་པ་རྣམས་བཟློག་པར་བགྱིའོ། །
en: We repel the terrible hosts of cruel bhūtas who steal the vitality of others.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། གནོད་སྦྱིན་འབུམ་འཕྲག་དུ་མ་དང་ལྷན་ཅིག་ཏུ་རྟག་པར་རྒྱུན་དུ་ལྷའི་མིག་རྣམ་པར་དག་པ། མིའི་ལས་འདས་པས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ལ་བལྟ་བར་བགྱི། བསྲུང་བར་བགྱི།
en: “Venerable Bhagavat, we Four Mahārājas, and the twenty-eight great generals of the yakṣas and many hundreds of thousands of yakṣas, are continually looking at all of Jambudvīpa with our pure divine vision, which transcends that of humans, and we defend it and protect it.

source: ཡོངས་སུ་བསྐྱང་བར་བགྱི་སྟེ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེའི་སླད་དུ། བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི། འཇིག་རྟེན་སྐྱོང་ཞེས་མིང་དུ་ཆགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་སུ་དག་འཛམ་བུའི་གླིང་འདིར་ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་ཡུལ་འཇོམས་པར་འགྱུར་རམ། མུ་གེའི་ཡ་ང་བའམ།
en: “Venerable Bhagavat, for that reason we Four Mahārājas are given the name world protectors.

source: ནད་ཀྱི་ཡ་ང་བའམ། གནོད་པ་སྣ་ཚོགས་བརྒྱ་དང་། གནོད་པ་སྟོང་དང་། གནོད་པ་འབུམ་དག་གིས་གཙེས་པར་འགྱུར་བ་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛིན་པའི་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་དག་ལ་བསྐུལ་བར་བགྱིའོ། །
en: “Venerable Bhagavat, wherever in this Jambudvīpa a country is defeated by an enemy army—or is stricken by the calamity of famine, or the calamity of disease, or a hundred various calamities, a thousand calamities, or a hundred thousand calamities— then, venerable Bhagavat, we Four Mahārājas will inspire the bhikṣus who possess this Lord King of Sūtras, the Sublime Golden Light.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ནམ་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས། རྫུ་འཕྲུལ་དང་། བྱིན་གྱིས་རླབས་ཀྱིས་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་དག་བསྐུལ་བ་ན། ཡུལ་གང་དང་གང་དུ་མཆིས་པར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡུལ་དེ་དང་དེ་དག་ཏུ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པར་འགྱུར་ཏེ། གང་དག་གནོད་པ་སྣ་ཚོགས་བརྒྱ་དང་། གནོད་པ་སྣ་ཚོགས་སྟོང་ཡུལ་དུ་འབྱུང་བ་འདི་ལྟ་བུ་འདི་དག་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: “Venerable Bhagavat, when we Four Mahārājas inspire dharmabhāṇaka bhikṣus through miracles and blessings, they will teach this Lord King of Sūtras, the Sublime Golden Light in whatever land they are in, and all the various calamities—a hundred calamites, a thousand calamities—that have appeared in that land will cease.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་གང་གི་ཡུལ་དུ་མདོ་སྡེའི་དབང་པོ་འཛིན་པའི་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་དག་མཆི་བར་འགྱུར་བའི་ཡུལ་དེ་དག་ཏུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡང་བསྙེན་པར་འགྱུར་རོ། །
en: “Venerable Bhagavat, in whatever lands there are dharmabhāṇaka bhikṣus who possess this Lord King of Sūtras, the Sublime Golden Light, then in those lands The Lord King of Sūtras, the Sublime Golden Light will be heard.
